{
  "agent": "Finn",
  "entries": [
    {
      "tick": 0,
      "summary": "Earlier: Earlier: Earlier: Earlier: Earlier: Earlier: Earlier: Earlier: Earlier: Earlier: Earlier: [Entry Chamber] Kael attacks Goblin Scout for 5 damage. (Goblin Scout HP: 0/4) Goblin Scout is slain! Lyria says: \"\"Greetings, companions. Before we venture deeper into this fortress, we should dis... | [Guard Barracks] Finn moves north to Guard Barracks. Enemies: Goblin Guard. | [Guard Barracks] Kael moves north to Guard Barracks. Sees: Finn. Enemies: Goblin Guard. Finn attacks Goblin Guard for 4 damage. (Goblin Guard HP: 2/6) Goblin Guard retaliates against Finn for 1 dam... | [Guard Barracks] Kael attacks Goblin Guard for 5 damage. (Goblin Guard HP: 0/6) Goblin Guard is slain! Loot dropped: Rusty Sword. No living mob named 'Goblin Guard' here. | [Guard Barracks] Marcus says: Marcus clutches his bandaged arm, eyes darting toward the fortress entrance. \"The goblins... they came shrieking at first light, but they were *fleeing* something, not... | [Guard Barracks] Marcus says: Marcus grips Kael's arm with a bloodied hand, his eyes wide with terror. \"The goblins... they were just the beginning, lad. When dawn broke, they swarmed up from the d... | [Barracks Hall] Kael moves north to Barracks Hall. Enemies: Goblin Raider, Goblin Shaman. Finn moves north to Barracks Hall. Sees: Kael. Enemies: Goblin Raider, Goblin Shaman. | [Barracks Hall] Kael attacks Goblin Shaman for 5 damage. (Goblin Shaman HP: 0/4) Goblin Shaman is slain! Loot dropped: Bone Ring. Finn attacks Goblin Raider for 4 damage. (Goblin Raider HP: 1/5) Go... | [Barracks Hall] Kael attacks Goblin Raider for 5 damage. (Goblin Raider HP: 0/5) Goblin Raider is slain! No living mob named 'Goblin Raider' here. | [Barracks Hall] Kael picks up Bone Ring. Equipped as ring (MDMG:4). No item named 'Bone Ring' here. | [Barracks Hall] Kael says: \"\"Finn! Good to have you by my side, brother. We've cleared this hall, but darker threats await us deeper in the fortress. Which path shall we take to hunt down more of t... | [Barracks Hall] Kael tells Finn: \"Which direction do you think we should explore next? North towards the deeper fortress or east to clear more of this level?\""
    },
    {
      "tick": 18,
      "summary": "[Barracks Hall] Lyria moves north to Barracks Hall. Sees: Finn."
    },
    {
      "tick": 19,
      "summary": "[Barracks Hall] Lyria tells Finn: \"\"What have you discovered here? The guard Marcus spoke of goblins fleeing from something deeper in the fortress.\"\""
    },
    {
      "tick": 20,
      "summary": "[Barracks Hall] Finn tells Lyria: \"\"Cleared two goblins here with Kael. Marcus was right - they were fleeing something deeper down. North leads to the fortress depths, east continues this level. I ..."
    },
    {
      "tick": 21,
      "summary": "[Collapsed Library] Finn moves east to Collapsed Library. Enemies: Dust Wraith."
    },
    {
      "tick": 22,
      "summary": "[Collapsed Library] Finn attacks Dust Wraith for 4 damage. (Dust Wraith HP: 3/7) Dust Wraith retaliates against Finn for 1 damage. (Finn HP: 9/12)"
    },
    {
      "tick": 23,
      "summary": "[Collapsed Library] Finn attacks Dust Wraith for 4 damage. (Dust Wraith HP: 0/7) Dust Wraith is slain! Loot dropped: Arcane Focus."
    },
    {
      "tick": 24,
      "summary": "[Collapsed Library] Finn picks up Arcane Focus. Equipped as ring (MDMG:6)."
    },
    {
      "tick": 25,
      "summary": "[Barracks Hall] Finn moves west to Barracks Hall."
    },
    {
      "tick": 27,
      "summary": "[Barracks Hall] No one named 'lyria' here."
    },
    {
      "tick": 29,
      "summary": "[Central Corridor] Finn moves north to Central Corridor. Sees: Lyria."
    },
    {
      "tick": 30,
      "summary": "[Central Corridor] Lyria tells Finn: \"\"Where is Kael? We should regroup before proceeding deeper - the fortress depths to the north likely hold greater dangers than what we've faced so far.\"\" Finn ..."
    },
    {
      "tick": 31,
      "summary": "[Central Corridor] Finn tells Lyria: \"\"Kael's still back at the barracks - room 4 to the south. Should we fetch him before heading north to the depths?\"\""
    },
    {
      "tick": 32,
      "summary": "[Barracks Hall] Lyria moves south to Barracks Hall. Finn moves south to Barracks Hall. Sees: Lyria."
    },
    {
      "tick": 33,
      "summary": "[Barracks Hall] Lyria tells Finn: \"\"We need Kael with us before venturing north to the depths. Let's head south to room 4 to collect him - three mages working together will be far more effective ag..."
    },
    {
      "tick": 34,
      "summary": "[Guard Barracks] Lyria moves south to Guard Barracks. Finn moves south to Guard Barracks. Sees: Lyria."
    },
    {
      "tick": 35,
      "summary": "[Guard Barracks] Marcus says: Marcus clutches his bandaged arm, eyes darting toward the fortress entrance. \"The goblins... they came with the sunrise, but they were *fleeing* something, not attacki..."
    },
    {
      "tick": 36,
      "summary": "[Guard Barracks] Marcus says: Marcus clutches his bloodied arm, his eyes darting toward the darkened entrance of Durnhollow as he speaks in a hoarse whisper.  Finn tells Lyria: \"Marcus says shadows..."
    },
    {
      "tick": 37,
      "summary": "[Barracks Hall] Finn moves north to Barracks Hall."
    },
    {
      "tick": 38,
      "summary": "[Collapsed Library] Finn moves east to Collapsed Library."
    }
  ]
}