{
  "agent": "Kael",
  "entries": [
    {
      "tick": 0,
      "summary": "Earlier: Earlier: Earlier: Earlier: Earlier: Earlier: Earlier: Earlier: Earlier: Earlier: Earlier: Earlier: Earlier: Earlier: Earlier: Earlier: [Entry Chamber] Kael attacks Goblin Scout for 5 damage. (Goblin Scout HP: 0/4) Goblin Scout is slain! Lyria says: \"\"Greetings, companions. Before we venture deeper into this fortress, we should dis... | [Entry Chamber] Kael says: \"\"Well fought! That goblin didn't stand a chance against my blade. Now, what wisdom do you have for us, Lyria? We must press forward and show these creatures the fury of ... | [Guard Barracks] Kael moves north to Guard Barracks. Sees: Finn. Enemies: Goblin Guard. Finn attacks Goblin Guard for 4 damage. (Goblin Guard HP: 2/6) Goblin Guard retaliates against Finn for 1 dam... | [Guard Barracks] Kael attacks Goblin Guard for 5 damage. (Goblin Guard HP: 0/6) Goblin Guard is slain! Loot dropped: Rusty Sword. No living mob named 'Goblin Guard' here. | [Guard Barracks] Marcus says: Marcus clutches his bandaged arm, eyes darting toward the fortress entrance. \"The goblins... they came shrieking at first light, but they were *fleeing* something, not... | [Guard Barracks] Marcus says: Marcus grips Kael's arm with a bloodied hand, his eyes wide with terror. \"The goblins... they were just the beginning, lad. When dawn broke, they swarmed up from the d... | [Barracks Hall] Kael moves north to Barracks Hall. Enemies: Goblin Raider, Goblin Shaman. Finn moves north to Barracks Hall. Sees: Kael. Enemies: Goblin Raider, Goblin Shaman. | [Barracks Hall] Kael attacks Goblin Shaman for 5 damage. (Goblin Shaman HP: 0/4) Goblin Shaman is slain! Loot dropped: Bone Ring. Finn attacks Goblin Raider for 4 damage. (Goblin Raider HP: 1/5) Go... | [Barracks Hall] Kael attacks Goblin Raider for 5 damage. (Goblin Raider HP: 0/5) Goblin Raider is slain! No living mob named 'Goblin Raider' here. | [Barracks Hall] Kael picks up Bone Ring. Equipped as ring (MDMG:4). No item named 'Bone Ring' here. | [Barracks Hall] Kael says: \"\"Finn! Good to have you by my side, brother. We've cleared this hall, but darker threats await us deeper in the fortress. Which path shall we take to hunt down more of t... | [Barracks Hall] Kael tells Finn: \"Which direction do you think we should explore next? North towards the deeper fortress or east to clear more of this level?\" | [Central Corridor] Kael moves north to Central Corridor. | [Great Hall] Kael moves north to Great Hall. Enemies: Shadow Warrior, Wraith. | [Great Hall] Kael attacks Shadow Warrior for 5 damage. (Shadow Warrior HP: 4/9) Shadow Warrior retaliates against Kael for 1 damage. (Kael HP: 14/15) | [Great Hall] Kael attacks Shadow Warrior for 5 damage. (Shadow Warrior HP: 0/9) Shadow Warrior is slain! Loot dropped: Shadow Blade. | [Great Hall] Kael picks up Shadow Blade. Equipped as weapon (ATK:6)."
    },
    {
      "tick": 20,
      "summary": "[Great Hall] Kael attacks Wraith for 6 damage. (Wraith HP: 2/8) Wraith retaliates against Kael for 1 damage. (Kael HP: 13/15)"
    },
    {
      "tick": 21,
      "summary": "[Great Hall] Kael attacks Wraith for 6 damage. (Wraith HP: 0/8) Wraith is slain!"
    },
    {
      "tick": 22,
      "summary": "[Spiral Staircase] Kael moves north to Spiral Staircase."
    },
    {
      "tick": 23,
      "summary": "[Crypt Entrance] Kael moves north to Crypt Entrance. Enemies: Skeleton Guardian, Bone Mage."
    },
    {
      "tick": 24,
      "summary": "[Crypt Entrance] Kael attacks Skeleton Guardian for 6 damage. (Skeleton Guardian HP: 2/8) Skeleton Guardian retaliates against Kael for 1 damage. (Kael HP: 12/15)"
    },
    {
      "tick": 25,
      "summary": "[Crypt Entrance] Kael attacks Skeleton Guardian for 6 damage. (Skeleton Guardian HP: 0/8) Skeleton Guardian is slain!"
    },
    {
      "tick": 26,
      "summary": "[Crypt Entrance] Kael attacks Bone Mage for 6 damage. (Bone Mage HP: 0/6) Bone Mage is slain! Loot dropped: Necromancer's Ring."
    },
    {
      "tick": 27,
      "summary": "[Crypt Entrance] Kael picks up Necromancer's Ring. Equipped as ring (MDMG:7)."
    },
    {
      "tick": 28,
      "summary": "[Antechamber of Doom] Kael moves north to Antechamber of Doom. Enemies: Death Knight."
    },
    {
      "tick": 29,
      "summary": "[Antechamber of Doom] Kael attacks Death Knight for 6 damage. (Death Knight HP: 12/18) Death Knight retaliates against Kael for 3 damage. (Kael HP: 9/15)"
    },
    {
      "tick": 30,
      "summary": "[Antechamber of Doom] Kael attacks Death Knight for 6 damage. (Death Knight HP: 6/18) Death Knight retaliates against Kael for 3 damage. (Kael HP: 6/15)"
    },
    {
      "tick": 31,
      "summary": "[Antechamber of Doom] Kael attacks Death Knight for 6 damage. (Death Knight HP: 0/18) Death Knight is slain! Loot dropped: Runic Greatsword."
    },
    {
      "tick": 32,
      "summary": "[Antechamber of Doom] Kael picks up Runic Greatsword. Equipped as weapon (ATK:8)."
    },
    {
      "tick": 33,
      "summary": "[The Shadowfell Rift] Kael moves north to The Shadowfell Rift. Enemies: Void Lord Malachar."
    },
    {
      "tick": 34,
      "summary": "[The Shadowfell Rift] Kael attacks Void Lord Malachar for 8 damage. (Void Lord Malachar HP: 22/30) Void Lord Malachar retaliates against Kael for 3 damage. (Kael HP: 3/15)"
    },
    {
      "tick": 35,
      "summary": "[The Shadowfell Rift] Kael heals for 5 HP. (HP: 8/15)"
    },
    {
      "tick": 36,
      "summary": "[The Shadowfell Rift] Kael attacks Void Lord Malachar for 8 damage. (Void Lord Malachar HP: 14/30) Void Lord Malachar retaliates against Kael for 3 damage. (Kael HP: 5/15)"
    },
    {
      "tick": 37,
      "summary": "[The Shadowfell Rift] Kael attacks Void Lord Malachar for 8 damage. (Void Lord Malachar HP: 6/30) Void Lord Malachar retaliates against Kael for 3 damage. (Kael HP: 2/15)"
    },
    {
      "tick": 38,
      "summary": "[The Shadowfell Rift] Kael attacks Void Lord Malachar for 8 damage. (Void Lord Malachar HP: 0/30) Void Lord Malachar is slain!"
    }
  ]
}