{
  "agent": "Lyria",
  "entries": [
    {
      "tick": 0,
      "summary": "Earlier: Earlier: Earlier: Earlier: Earlier: Earlier: Earlier: Earlier: Earlier: Earlier: Earlier: Earlier: [Entry Chamber] Kael attacks Goblin Scout for 5 damage. (Goblin Scout HP: 0/4) Goblin Scout is slain! Lyria says: \"\"Greetings, companions. Before we venture deeper into this fortress, we should dis... | [Entry Chamber] Kael says: \"\"Well fought! That goblin didn't stand a chance against my blade. Now, what wisdom do you have for us, Lyria? We must press forward and show these creatures the fury of ... | [Entry Chamber] No one named 'kael' here. | [Guard Barracks] Marcus says: Marcus clutches his bandaged arm, eyes darting toward the fortress entrance. \"The goblins... they came shrieking at first light, but they were *fleeing* something, not... | [Guard Barracks] Marcus says: Marcus grips Kael's arm with a bloodied hand, his eyes wide with terror. \"The goblins... they were just the beginning, lad. When dawn broke, they swarmed up from the d... | [Guard Barracks] Marcus says: Marcus grips his bloodied sword with trembling hands, his eyes darting toward the fortress entrance. \"The goblins... they came with the dawn, but they were fleeing som... | [Guard Barracks] Marcus says: Marcus clutches his bloodied shoulder, eyes darting nervously toward the fortress entrance. \"The goblins... they came with the dawn, shrieking like the damned, but the... | [Guard Barracks] Marcus says: Marcus clutches his bloodied bandages and looks up at Lyria with haunted eyes. \"The goblins... they came at first light, but they were fleeing something, not attacking... | [Guard Barracks] Marcus says: Marcus grips Lyria's arm with a bloodied hand, his eyes wide with terror. \"The goblins were just the beginning—when dawn broke, something far darker stirred in the dep... | [Guard Barracks] Marcus says: Marcus clutches his bandaged arm, his eyes darting toward the fortress entrance. \"The goblins... they came with the first light, shrieking like the damned, but by the ... | [Guard Barracks] Marcus says: Marcus clutches his bloodied bandage and looks up at Lyria with haunted eyes. \"The goblins hit us at first light, aye, but they were *fleeing* from something deeper in... | [Guard Barracks] Marcus says: Marcus clutches his bloodied arm and looks up at Lyria with haunted eyes. \"The goblins... they swarmed us at first light, but they were *fleeing* from something deeper... | [Guard Barracks] Marcus says: Marcus clutches his bandaged arm, eyes darting nervously toward the fortress entrance. \"The goblins... they came with the first light, but they were running *from* som..."
    },
    {
      "tick": 15,
      "summary": "[Guard Barracks] Marcus says: Marcus clutches his bloodied shoulder and looks up at Lyria with haunted eyes. \"The goblins... they came with the dawn, but they were running *from* something deeper i..."
    },
    {
      "tick": 16,
      "summary": "[Guard Barracks] Marcus says: Marcus clutches his bandaged arm, eyes darting toward the fortress entrance. \"The goblins... they came shrieking at first light, but that was nothing compared to what ..."
    },
    {
      "tick": 17,
      "summary": "[Guard Barracks] Marcus says: Marcus clutches his bloodied arm and looks up at Lyria with haunted eyes. \"The goblins... they came with the dawn, screaming like banshees, but that was nothing compar..."
    },
    {
      "tick": 18,
      "summary": "[Barracks Hall] Lyria moves north to Barracks Hall. Sees: Finn."
    },
    {
      "tick": 19,
      "summary": "[Barracks Hall] Lyria tells Finn: \"\"What have you discovered here? The guard Marcus spoke of goblins fleeing from something deeper in the fortress.\"\""
    },
    {
      "tick": 20,
      "summary": "[Barracks Hall] Finn tells Lyria: \"\"Cleared two goblins here with Kael. Marcus was right - they were fleeing something deeper down. North leads to the fortress depths, east continues this level. I ..."
    },
    {
      "tick": 21,
      "summary": "[Barracks Hall] Lyria tells Finn: \"\"Where is Kael now? We should regroup before venturing deeper into the fortress depths.\"\""
    },
    {
      "tick": 23,
      "summary": "[Barracks Hall] No one named 'finn' here."
    },
    {
      "tick": 25,
      "summary": "[Central Corridor] Lyria moves north to Central Corridor."
    },
    {
      "tick": 29,
      "summary": "[Central Corridor] Finn moves north to Central Corridor. Sees: Lyria."
    },
    {
      "tick": 30,
      "summary": "[Central Corridor] Lyria tells Finn: \"\"Where is Kael? We should regroup before proceeding deeper - the fortress depths to the north likely hold greater dangers than what we've faced so far.\"\" Finn ..."
    },
    {
      "tick": 31,
      "summary": "[Central Corridor] Finn tells Lyria: \"\"Kael's still back at the barracks - room 4 to the south. Should we fetch him before heading north to the depths?\"\""
    },
    {
      "tick": 32,
      "summary": "[Barracks Hall] Lyria moves south to Barracks Hall. Finn moves south to Barracks Hall. Sees: Lyria."
    },
    {
      "tick": 33,
      "summary": "[Barracks Hall] Lyria tells Finn: \"\"We need Kael with us before venturing north to the depths. Let's head south to room 4 to collect him - three mages working together will be far more effective ag..."
    },
    {
      "tick": 34,
      "summary": "[Guard Barracks] Lyria moves south to Guard Barracks. Finn moves south to Guard Barracks. Sees: Lyria."
    },
    {
      "tick": 35,
      "summary": "[Guard Barracks] Marcus says: Marcus clutches his bandaged arm, eyes darting toward the fortress entrance. \"The goblins... they came with the sunrise, but they were *fleeing* something, not attacki..."
    },
    {
      "tick": 36,
      "summary": "[Guard Barracks] Marcus says: Marcus clutches his bloodied arm, his eyes darting toward the darkened entrance of Durnhollow as he speaks in a hoarse whisper.  Finn tells Lyria: \"Marcus says shadows..."
    },
    {
      "tick": 37,
      "summary": "[Guard Barracks] Marcus says: Marcus clutches his bloodied arm and looks up at Lyria with haunted eyes. \"The goblins... they came with the dawn, but they were fleeing from something deeper in the f..."
    },
    {
      "tick": 38,
      "summary": "[Guard Barracks] No one named 'finn' here."
    }
  ]
}